## Parte 6 - Add / Remove rows and columns

Importando Pandas

In [1]:
import pandas as pd

### DataFrame de pruebas

In [2]:
diccionario = {"nombres": ["Manuel", "Tomás", "Sebastián"],
               "apellidos": ["Klug", "Smith", "Jackson"],
              "edad": [23, 23, 22],
              "mails": ["mk@g.com", "tm@g.com", "st@g.com"]}

df_dicc = pd.DataFrame(diccionario)

df_dicc

     nombres apellidos  edad     mails
0     Manuel      Klug    23  mk@g.com
1      Tomás     Smith    23  tm@g.com
2  Sebastián   Jackson    22  st@g.com

#### Agregar columnas

In [3]:
df_dicc["nombre_completo"] = df_dicc["nombres"] + " " + df_dicc["apellidos"]

In [4]:
df_dicc

     nombres apellidos  edad     mails    nombre_completo
0     Manuel      Klug    23  mk@g.com        Manuel Klug
1      Tomás     Smith    23  tm@g.com        Tomás Smith
2  Sebastián   Jackson    22  st@g.com  Sebastián Jackson

#### Eliminar columnas

In [5]:
df_dicc.drop(columns=["nombres", "apellidos"], inplace=True)

In [6]:
df_dicc

   edad     mails    nombre_completo
0    23  mk@g.com        Manuel Klug
1    23  tm@g.com        Tomás Smith
2    22  st@g.com  Sebastián Jackson

#### Separar una columna

In [7]:
df_dicc[["nombre", "apellido"]] = df_dicc["nombre_completo"].str.split(" ", expand=True)

In [8]:
df_dicc

   edad     mails    nombre_completo     nombre apellido
0    23  mk@g.com        Manuel Klug     Manuel     Klug
1    23  tm@g.com        Tomás Smith      Tomás    Smith
2    22  st@g.com  Sebastián Jackson  Sebastián  Jackson

#### Agregar filas

In [9]:
# Forma 1

In [10]:
df_dicc.append({"nombre": "Tony"}, ignore_index=True)

   edad     mails    nombre_completo     nombre apellido
0  23.0  mk@g.com        Manuel Klug     Manuel     Klug
1  23.0  tm@g.com        Tomás Smith      Tomás    Smith
2  22.0  st@g.com  Sebastián Jackson  Sebastián  Jackson
3   NaN       NaN                NaN       Tony      NaN

In [11]:
# Forma 2

In [12]:
diccionario_2 = {"nombre": ["Luz", "Laila"],
               "apellido": ["Roberts", "Walker"],
              "edad": [25, 25],
              "mails": ["lr@g.com", "lw@g.com"]}
                             
df_dicc2 = pd.DataFrame(diccionario_2)
                             
df_dicc2

  nombre apellido  edad     mails
0    Luz  Roberts    25  lr@g.com
1  Laila   Walker    25  lw@g.com

In [15]:
df_dicc = df_dicc.append(df_dicc2, ignore_index=True, sort=False)

In [16]:
df_dicc

   edad     mails    nombre_completo     nombre apellido
0    23  mk@g.com        Manuel Klug     Manuel     Klug
1    23  tm@g.com        Tomás Smith      Tomás    Smith
2    22  st@g.com  Sebastián Jackson  Sebastián  Jackson
3    25  lr@g.com                NaN        Luz  Roberts
4    25  lw@g.com                NaN      Laila   Walker

#### Eliminar filas

In [17]:
df_dicc.drop(index=4)

   edad     mails    nombre_completo     nombre apellido
0    23  mk@g.com        Manuel Klug     Manuel     Klug
1    23  tm@g.com        Tomás Smith      Tomás    Smith
2    22  st@g.com  Sebastián Jackson  Sebastián  Jackson
3    25  lr@g.com                NaN        Luz  Roberts